// -------------------------------------------------------------------------------------------
// @说      明: 业务逻辑对象池数据类接口
// @作      者: zhoumingfeng
// @版  本  号: V1.00
// @创建时间: 2024.05.29
// -------------------------------------------------------------------------------------------
namespace Framework.Pool
{
    public interface ILogicData
    {
        /// <summary>
        /// 清理数据,防止从池中取出的数据是脏数据
        /// </summary>
        void Clear();

        /// <summary>
        /// 设置为脏数据,此时数据会被清理并回池
        /// </summary>
        void SetDirty();
    }
}